
// ****************************************************************************
//
//                     Auxiliaries - UART1, SPI1, SPI2
//
// ****************************************************************************
// Note - AUX timing is derived from the VideoCore system clock, which may change during operation.
// To ensure a stable frequency, use parameters "force_turbo=1" and "core_freq=..." in config.txt.
// SPI2 is present in Pi 4 and higher chips, but it is not mapped to any GPIO pins and is therefore unusable.

/*
UART1 (Mini-UART):
	Stop bit is not checked - it is ignored, only wait some time for next bit.
	If enabled, it will immediately start receiving data, expecially if RX line
	is low (= start bit). Immediately after a reset, the baudrate register
	will be zero and the system clock will be 250 MHz. So only 2.5 us
	suffice to fill the receive FIFO. The result will be that if the UART
	is enabled without changing the default configuration, the FIFO will be
	full and overflowing in no time flat.
	GPIO pins should be set up first before enabling the UART.
    features:
	- 7 or 8 bit
	- 1 start and 1 stop bit
	- no parity
	- break generation
	- 8-level FIFO or receive and tramsmit
	- SW controlled RTS, SW readable CTS
	- auto flow control with programmable FIFO level
	- 16550 like registers
	- Baudrate derived from system clock (use force_turbo and core_freq in config.txt)
		8-times oversampling, Baudrate = CoreClock / (8*(baudrate_divider+1)),
		at 250 MHz: Baudrate = 476 Baud ... 31.25 MBaud
	- No framing error detection
	- No receive time-out interrupt
	- No DCD, DSR, DTR or RI signals

    Usual baudrates with system clock 250 MHz:

	req.Baud	divider		real Baud	error %
	-------------------------------------------------------
			65535		476.8
	477		65513		477		-0,001%
	600		52082		600		0,001%
	1200		26041		1200		-0,001%
	1800		17360		1800		0,001%
	2400		13020		2400		-0,001%
	3600		8680		3600		-0,005%
	4800		6509		4800		0,006%
	5787		5399		5787		0,001%
	7200		4339		7200		0,006%
	9600		3254		9601		0,006%
	10400		3004		10399		-0,006%
	14400		2169		14401		0,006%
	19200		1627		19195		-0,024%
	28800		1084		28802		0,006%
	38400		813		38391		-0,024%
	56000		557		56004		0,006%
	57600		542		57551		-0,086%
	115200		270		115314		0,099%
	128000		243		128074		0,058%
	134400		232		134120		-0,208%
	161280		193		161082		-0,122%
	201600		154		201613		0,006%
	230400		135		229779		-0,269%
	256000		121		256148		0,058%
	268800		115		269397		0,222%
	403200		77		400641		-0,635%
	460800		67		459559		-0,269%
	614400		50		612745		-0,269%
	806400		38		801282		-0,635%
	921600		33		919118		-0,269%
	1228800		24		1250000		1,725%
	2457600		12		2403846		-2,187%
	3000000		9		3125000		4,167%
	6000000		4		6250000		4,167%
			3		7812500
			2		10416667
			1		15625000
			0		31250000
*/

/*
SPI1, SPI2:
SPI2 is present in Pi 4 and higher chips, but it is not mapped to any GPIO pins and is therefore unusable.
	- speed up to SPI clock 125 MHz
	- single-beat bit length 1 - 32 bits
	- signle-beat variabe bit length 1 - 24 bits
	- multi-beat infinite bit length
	- 3 independent chip selects per master
	- 4 entries 32-bit wide transmit and receive FIFOs
	- data out on rising or falling clock edge
	- clock inversion (idle high or idle low)
	- shift in/out MS or LS bit first
	- SPI speed = CoreClock / (2*(divider+1)) ... range 30.5 kHz to 125MHz (on core clock 250 MHz)
*/

#ifndef _SDK_AUX_H
#define _SDK_AUX_H

// UART1 RTS level control 1..4 empty spaces left to de-assert RTS output signal
#define UART1_RTSLEVEL_1	2	// 1 empty space left
#define UART1_RTSLEVEL_2	1	// 2 empty spaces left
#define UART1_RTSLEVEL_3	0	// 3 empty spaces left
#define UART1_RTSLEVEL_4	3	// 4 empty spaces left

// SPI1/SPI2 extra data out hold time in system clocks
#define SPI12_HOLD_NO		0	// no additional clocks
#define SPI12_HOLD_1		1	// 1 additional clock
#define SPI12_HOLD_4		2	// 4 additional clocks
#define SPI12_HOLD_7		3	// 7 additional clocks

// SPI1/SPI2 pattern output CSx bits
#define SPI12_CS0		B0	// output on CS0 pin
#define SPI12_CS1		B1	// output on CS0 pin
#define SPI12_CS2		B2	// output on CS0 pin

// Mini-UART structure
typedef struct
{
	io32	IO;		// 0x00: Mini-UART I/O data
				//  if DLAB bit is 0:
				//	bit 0..7: received/written byte
				//  if DLAB bit is 1:
				//	bit 0..7: low byte of baudrate divider

	io32	IER;		// 0x04: Mini-UART interrupt enable
				//  if DLAB bit is 0:
				//	bit 0: 1=enable transmit interrupt when transmit FIFO is empty
				//	bit 1: 1=enable receive interrupt when receive FIFO holds at least 1 byte
				//  if DLAB bit is 1:
				//	bit 0..7: high byte of baudrate divider

	io32	IIR;		// 0x08: Mini-UART interrupt status
				//	bit 0: 0=interrupt is pending (read-only)
				//	bit 1,2: read: 0=no interrupt, 1=trasmit empty, 2=receive valid 3=(not possible)
				//		write '1' to bit 1 to clear receive FIFO
				//		write '1' to bit 2 to clear transmit FIFO

	io32	LCR;		// 0x0C: Mini-UART line control
				//	bit 0,1: data byte 00=7 bits, 11=8 bits
				//	bit 6: Break, 1=UART1_TX line is pulled low continuously
				//		If held for at least 12 bits times that will indicate a break condition.
				//	bit 7: DLAB, access to baudrate register 1=using MU_IO and MU_IER, 0=using MU_BAUD
				//		If must be 0 during operation.

	io32	MCR;		// 0x10: Mini-UART modem control
				//	bit 1: write 1=RTS line is low, 0=RTS line is high
				//		RTS line is output to control remote transmitter by receiver.
				//		This bit is ignored if the RTS is used for auto-flow control.

	io32	LSR;		// 0x14: (read only) Mini-UART line status
				//	bit 0: 1=receive FIFO holds at least 1 byte
				//	bit 1: 1=receiver FIFO overrun (read this register to clear it)
				//		- to read without clear, use STAT register
				//	bit 5: 1=transmit FIFO can accept at least 1 byte (not full)
				//	bit 6: 1=transmit FIFO is empty and transmitter is idle (finished shifting out the last bit)
	
	io32	MSR;		// 0x18: (read only) Mini-UART modem status
				//	bit 4: read 1=CTS line is low, 0=CTS line is high
				//		CTS line is input to control transmitter by remoter receiver.

	io32	SCRATCH;	// 0x1C: Mini-UART scratch
				//	bit 0..7: single byte storage, one whole byte extra on top, provided by SDC

	io32	CTRL;		// 0x20: Mini-UART extra control
				//	bit 0: 1=mini-UART receiver enabled
				//		when disabling receiver: disable, wait until receiver idle, then change baudrate
				//		If this bit is clear no new symbols will be accepted by the receiver.
				//		Any symbols in progress of reception will be finished.
				//	bit 1: 1=mini-UART transmitter enabled
				//		If this bit is clear no new symbols will be sent by the transmitter.
				//		Any symbols in progress of transmission will be finished.
				//	bit 2: 1=RTS auto-flow controlled by receiver, 0=RTS controlled by MU_MCR (RTS is output)
				//	bit 3: 1=CTS auto-flow controls transmitter, 0=CTS ignored by transmitter (CTS is input)
				//	bit 4..5: receiver control level RTS (de-assert: RTS line will be set to DISABLE state)
				//		0 = de-assert RTS if 3 empty spaces left
				//		1 = de-assert RTS if 2 empty spaces left
				//		2 = de-assert RTS if 1 empty spaces left
				//		3 = de-assert RTS if 4 empty spaces left
				//	bit 6: RTS flow assert level (=ENABLE) is 1=low, 0=high
				//	bit 7: CTS flow assert level (=ENABLE) is 1=low, 0=high

	io32	STAT;		// 0x24: Mini-UART extra status (read only)
				//	bit 0: 1=mini-UART receive FIFO contains at least 1 byte
				//	bit 1: 1=mini-UART transmitter FIFO can accept at least 1 more byte (= not full)
				//	bit 2: 1=receiver is idle (useful if the receiver is disabled, before change baudrate)
				//	bit 3: 1=transmitter is idle (set for short time if transmit FIFO contains data)
				//	bit 4: 1=receiver FIFO overrun (read LSR register to clear)
				//	bit 5: 1=transmit FIFO is full (= inverse of bit 1)
				//	bit 6: status of UART1_RTS line
				//	bit 7: status of UART1_CTS line
				//	bit 8: 1=transmitter FIFO is empty (can accept 8 bytes)
				//	bit 9: 1=transmitter is idle and transmit FIFO is empty (= bit 3 AND bit 8 = "Transmitter Done")
				//	bit 16..19: number of bytes in receive FIFO 0..8
				//	bit 24..27: number of bytes in transmit FIFO 0..8

	io32	BAUD;		// 0x28: Mini-UART baudrate divider
				//	bit 0..15: baudrate divider (or alternative access using DLAB=1)
				//		baudrate = CoreClock / ( 8 * (baudrate_divider + 1) )
				//		with 250 MHz is baudrate in range 477 Baud .. 31.25 MBaud
} AuxUART_t;
STATIC_ASSERT(sizeof(AuxUART_t) == 0x2C, "Incorrect AuxUART_t!");

// SPI structure
typedef struct
{
	io32	CTRL0;		// 0x00: SPI control register 0
				//	bit 0..5: shift length, number of bits to shift (only if not variable shift mode)
				//	bit 6: start out data with 0=LS (low bit), 1=MS (most significiant bit = bit 31 or 23)
				//	bit 7: 'idle' clock line is 0=low, 1=high
				//	bit 8: data is clocked OUT on 0=falling, 1=rising edge of the clock
				//	bit 9: clear FIFO, 1=receive and transmit FIFOs are held in reset and flushed, 0=normal operation
				//	bit 10: data is clocked IN on 0=falling, 1=rising edge of the clock
				//	bit 11: 1=enable SPI, 0=disable SPI but FIFO can still be written or read
				//	bit 12..13: extra data out hold time in system clocks 0=no, 1=1 clk (4 ns), 2=4 clk (16 ns), 3=7 clk (28 ns)
				//		- holds MOSI data additional more time after clock edge
				//	bit 14: variable width 1=shift length and data from TX fifo, 0=shift length from bits 0..5 of this register
				//			if variable data length from FIFO: bit 0..23=data, bit 24..28=shift length 0..24
				//	bit 15: variable CS pattern taken from 1=TX fifo (bit 14 must be set too), 0=from bits 17..19 of this register
				//			if variable data length from FIFO: bit 0..23=data, bit 29..31=CS0..CS2 pattern
				//	bit 16: 1=post-input mode (input data are taken 1 bit later)
				//	bit 17: pattern output on CS0 pin
				//	bit 18: pattern output on CS1 pin
				//	bit 19: pattern output on CS2 pin
				//	bit 20..31: SPI clock divider 0..4095, speed = CoreClock/(2*(divider+1))
				//			with 250 MHz is range 30517 Hz .. 125 MHz

	io32	CTRL1;		// 0x04: SPI control register 1
				//	bit 0: 1=receiver shift register is not cleared between transactions
				//		- it enables concatenate data in FIFO entries (you'll get 0x0081 0x8146 instead of 0x0081 0x0046)
				//		0=clear receiver shift register before each transaction
				//	bit 1: start IN data with 0=LS (low bit), 1=MS (most significiant bit)
				//	bit 6: 1=interrupt line is high when SPI is idle (no transmission, CS is high)
				//	bit 7: 1=interrupt line is high when transmit FIFO is empty (can send next data)
				//	bit 8..10: 0..7 additional clock cycles when CS goes high after end of transmission

	io32	STAT;		// 0x08: (read only) SPI status
				//	bit 0..5: number of bits still to be processed 0..32 (starts with 'shift length' and counts down)
				//	bit 6: 1=module is busy transferring data
				//	bit 7: 1=receiver FIFO is empty
				//	bit 8: 1=receiver FIFO is full
				//	bit 9: 1=transmit FIFO is empty
				//	bit 10: 1=transmit FIFO is full
				//	bit 16..19: number of entries 0..4 in receive FIFO
				//	bit 24..27: number of entries 0..4 in transmit FIFO

	io32	PEEK;		// 0x0C: SPI peek (read only), read will show top received entry, but not delete it from FIFO
	
	io32	res[4];		// 0x10 (16 = 0x10): ... reserved

	io32	IO[4];		// 0x20 (16 = 0x10): last SPI data, CS end (all 4 registers are the same - you can use any of them),
				//	send data with de-assert CS (= last entry), receive data (same as TXHOLD)

	io32	TXHOLD[4];	// 0x30 (16 = 0x10): middle SPI data, CS hold (all 4 registers are the same - you can use any of them),
				//	send data without de-assert CS (= middle entry), receive data (same as IO)
} AuxSPI_t;
STATIC_ASSERT(sizeof(AuxSPI_t) == 0x40, "Incorrect AuxSPI_t!");

// AUX structure
typedef struct
{
	io32	IRQ;		// 0x00: (read only) Auxiliary interrupt status
				//	bit 0: 1=mini-UART has interrupt pending
				//	bit 1: 1=SPI1 has interrupt pending
				//	bit 2: 1=SPI2 has interrupt pending

	io32	ENABLE;		// 0x04: Auxiliary enables (if disabled, peripheral registers are unaccessbile)
				//	bit 0: 1=mini-UART enabled (if disabled, all mini-UART registers are disabled)
				//	   If enabled, it will immediately start receiving data, expecially if RX line is low = start bit.
				//	   GPIO pins should be set up first before enabling the UART.
				//	bit 1: 1=SPI1 enabled (if disabled, all SPI1 registers are disabled)
				//	bit 2: 2=SPI2 enabled (if disabled, all SPI2 registers are disabled)

	io32	res1[14];	// 0x08 (56 = 0x38): ... reserved

	AuxUART_t uart;		// 0x40 (44 = 0x2C): UART1 (Mini-UART)

	io32	res2[5];	// 0x6C (20 = 0x14): ... reserved

	union {
	        AuxSPI_t spi[2];	// 0x80 (2*64 = 2*0x40): SPI1, SPI2
		struct {
		        AuxSPI_t spi1;	// 0x80 (64 = 0x40): SPI1
		        AuxSPI_t spi2;	// 0xC0 (64 = 0x40): SPI2
	// SPI2 is present in Pi 4 and higher chips, but it is not mapped to any GPIO pins and is therefore unusable.
		};
	};

} AUX_t;
STATIC_ASSERT(sizeof(AUX_t) == 0x100, "Incorrect AUX_t!");

// AUX peripheral
#define AUX		((AUX_t*)ARM_AUX_BASE)

// ==== UART1
// Before enable UART1, setup GPIO pins with GPIO_Func(gpio, GPIO_FUNC_AF5). Use GPIOs:
//  TXD1: GPIO14, GPIO32, GPIO40
//  RXD1: GPIO15, GPIO33, GPIO41
//  CTS1: GPIO16, GPIO30, GPIO43
//  RTS1: GPIO17, GPIO31, GPIO42

// UART1 enable/disable/check
// - If enabled, it will immediately start receiving data, expecially if RX line is low (= start bit is active).
// - If disabled, all mini-UART registers are disabled and unaccessbile.
// - GPIO pins should be set up first before enabling the UART.
// - DLAB bit should be clear to 0 for many functions.
INLINE void UART1_Enable(void) { AUX->ENABLE |= B0; }
INLINE void UART1_Disable(void) { AUX->ENABLE &= ~B0; }
